import React from "react";
import styles from "./Delivery.module.scss";

const Delivery: React.FC = () => {
  return (
    <div className="page">
      <div className={styles.delivery}>
        <h1>ДОСТАВКА ТА ПОВЕРНЕННЯ</h1>
        <section className={styles.section}>
          <h2>УМОВИ ДОСТАВКИ</h2>
          <p className={styles.warning}>
            ВАЖЛИВЕ ПОВІДОМЛЕННЯ – ВІЙНА В УКРАЇНІ: Через війну можливі невеликі затримки.
            Після відправки ваше замовлення прибуде протягом 2-6 робочих днів.
          </p>
          <ul className={styles.list}>
            <li>Замовлення по Україні відправляються «Новою Поштою» (2-3 робочих дні)</li>
            <li>Замовлення по Польщі відправляємо «Нова пошта» (3-5 робочих дні)</li>
            <li>Замовлення по США та Канаді відправляються «Пошта Канади» (1-3 робочих дні)</li>
            <li>Міжнародна доставка Meest Express (10-12 робочих днів)</li>
          </ul>
          <p className={styles.freeShipping}>БЕЗКОШТОВНА ЕКСПРЕС-доставка замовлень на суму понад 300$</p>
          <p>Зверніть увагу: ми не доставляємо товари в Росію та Білорусь.</p>
        </section>
        <section className={styles.section}>
          <h2>ВІДСТЕЖУЙТЕ СВОЄ ЗАМОВЛЕННЯ</h2>
          <p>
            Щойно ваше замовлення буде відправлено, ви отримаєте електронний лист із інформацією про відстеження.
            Усі деталі відстеження є в електронному листі.
          </p>
          <p>
            Мита та податки: можуть стягуватися митні збори та/або ПДВ. FBE не несе відповідальності за митні або місцеві податки.
          </p>
        </section>
        <section className={styles.section}>
          <h2>ПОВЕРНЕННЯ</h2>
          <p>Купальники поверненню та обміну не підлягають.</p>
        </section>
        <section className={styles.section}>
          <h2>ОПЛАТА</h2>
          <div className={styles.payment}>
            <h3>Рахунок на оплату</h3>
            <p>
              Після оформлення замовлення ми надішлемо вам рахунок на електронну пошту або у месенджер.
              Ви зможете оплатити замовлення зручним способом. Після оплати отримаєте підтвердження та деталі доставки.
            </p>
            <h3>Передоплата</h3>
            <p>
              Для замовлень, де потрібна передоплата, необхідно внести <strong>200₴</strong>.
              Ця сума гарантує резервування товару.
            </p>
            <h3>Післяплата / оплата повної суми</h3>
            <p>
              Якщо товар оплачується повністю після отримання рахунку, оплатіть зазначену суму згідно з інструкціями.
              Після отримання платежу ми відправимо ваше замовлення.
            </p>
          </div>
        </section>
      </div>
    </div>
  );
};

export default Delivery;
